#!/usr/bin/env python
# -*- coding: utf-8 -*-
"""
------------------------------------------------------
    Project : TongmingClient
    File    : dict_const.py 
    Time    : 2018/01/21 
    Author  : liulijun
    Site    : https://github.com/markliu666/
------------------------------------------------------
"""
BEIJING_TOWN={'东城区':0,'西城区':1,'朝阳区':2,'丰台区':3,'石景山区':4,'海淀区':5,'门头沟区':6,'房山区':7,'通州区':8,'顺义区':8,'昌平区':9,'大兴区':10,'怀柔区':11,'平谷区':12,'密云区':13,'延庆区':14}

AGE_ITEM={'新生儿':['光照反应','视动性眼震','外眼检查','瞳孔对光反射','眼底红光反射'],
             '42天':['视觉行为','视动性眼震','外眼检查','视力初筛','瞳孔对光反射','眼底红光反射'],
             '5-6月':['视觉行为','视动性眼震','外眼检查','婴幼儿选择性注视','眼底红光反射','眼位检查','眼球震颤检查'],
             '一岁':['视觉行为','外眼检查','婴幼儿选择性注视','点状视力检测','眼底红光反射','眼位检查','屈光检查'],
             '二岁':['视觉行为','外眼检查','婴幼儿选择性注视','点状视力检测','婴幼儿视锐度检查','眼底红光反射','眼位检查','屈光检查'],
             '三岁':['视觉行为','点状视力检测','视力检查','婴幼儿视锐度检查','儿童图形视力卡','外眼及眼前节检查','眼位检查','屈光检查','眼球震颤检查','眼底检查'],
             '四岁':['视觉行为','点状视力检测','视力检查','儿童图形视力卡','外眼及眼前节检查','屈光检查','眼球震颤检查','眼底检查','眼位检查'],
             '五岁':['视觉行为','点状视力检测','视力检查','儿童图形视力卡','外眼及眼前节检查','屈光检查','眼球震颤检查','眼底检查','眼位检查'],
             '六岁':['视觉行为','外眼及眼前节检查','视力检查','屈光检查','眼球震颤检查','眼底检查','眼位检查']}

ITEM_CN_EN={'光照反应右眼':'light_response_right',
            '光照反应左眼': 'light_response_left',
            '视动性眼震左眼': 'optic_nystagmus_left',
            '视动性眼震右眼': 'optic_nystagmus_right',
            '外眼检查左眼': 'outer_eye_check_left',
            '外眼检查右眼': 'outer_eye_check_right',
            '瞳孔对光反射左眼': 'pupil_reflects_on_light_left',
            '瞳孔对光反射右眼': 'pupil_reflects_on_light_right',
            '眼底红光反射左眼': 'reflex_red_eyes_left',
            '眼底红光反射右眼': 'reflex_red_eyes_right',
            '视觉行为': 'visual_behavior',
            '视力初筛': 'eye_sight_first_time_filter',
            '婴幼儿选择性注视左眼': 'infants_selective_gaze_left',
            '婴幼儿选择性注视右眼': 'infants_selective_gaze_right',
            '眼位检查': 'eye_direction',
            '眼底检查': 'fundus_check',
            '眼球震颤检查': 'nystagmus_check',
            '点状视力检测左眼': 'reflex_red_eyes_left',
            '点状视力检测右眼': 'reflex_red_eyes_right',
            '屈光检查': 'refraction_check_status',
            '婴幼儿视锐度检查左眼': 'infant_vision_acuity_check_left',
            '婴幼儿视锐度检查右眼': 'infant_vision_acuity_check_right',
            '儿童图形视力卡左眼': 'children_graphics_vision_card_left',
            '儿童图形视力卡右眼': 'children_graphics_vision_card_right',
            '外眼及眼前节检查': 'outer_eye_anterior_segment_check',
            '视力检查左眼远视力':'eye_sight_check_left_ysl',
            '视力检查左眼近视力': 'eye_sight_check_left_jsl',
            '视力检查左眼矫正视力': 'eye_sight_check_left_jzsl',
            '视力检查右眼远视力': 'eye_sight_check_right_ysl',
            '视力检查右眼近视力': 'eye_sight_check_right_jsl',
            '视力检查右眼矫正视力':'eye_sight_check_right_jzsl'}

ITEM_OPTIONS={'光照反应':['正常','弱','无反应','未检查'],
              '视动性眼震': ['可引出眼震','未引出眼震','不配合','未检查'],
              '外眼检查': ['未见异常','泪道堵塞','结膜炎','其它：','未检查'],
              '瞳孔对光反射': ['正常','异常','未检查'],
              '眼底红光反射': ['正常','异常','未检查'],
              '视觉行为': ['通过','未通过','未检查'],
              '视力初筛': ['正常','无','不配合','未检查'],
              '眼位检查': ['正视','斜视','未检查'],
              '眼球震颤检查': ['无震颤','有震颤','未检查'],
              '屈光检查': ['正常范围','可疑(近视,远视,散光)','异常(近视,远视,散光)','未检查'],
              '眼底检查': ['正常','异常','未检查'],
              '外眼及眼前节检查': ['正常','异常','未检查']}
